app/Controllers/Buku.php

SELECT *
FROM `buku`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `buku`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');


        if ($keyword) {

            $buku_query = $this->bukuModel->search($keyword);
        } else {

            $buku_query = $this->bukuModel;
        }

        $data = [
            'title'   => 'Daftar Buku Digital',

            'buku'    => $buku_query->paginate(5, 'buku'),

UPDATE `buku` SET `judul` = 'Stoig ', `penulis` = 'Seneka', `penerbit` = 'Filsufut mooda', `tahun_terbit` = '1780', `sinopsis` = 'asdqw1asdasd'
WHERE `buku`.`id_buku` IN ('12')
---
    public function update($id = null)
    {
        $data = $this->request->getPost();

        $this->bukuModel->update($id, $data);